Revit 2026 API

# CoreType Enumeration

---

An enumerated type to list all core types.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum CoreType
```
```vb
Public Enumeration CoreType
```
```cpp
public enum class CoreType
```
```fsharp
type CoreType
```

| Member name | Value | Description |
| --- | --- | --- |
| MultiCore | 1 | Core type is multi core. |
| SingleCore | 0 | Core type is single core. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace